
# ------------------------------------------------------------------------------------------------
# ВНИМАНИЕ! Изменяемый параметр при новом проекте.
# Токен Бота
TOKEN = ''

# ВНИМАНИЕ! При новом проекте таблица меняется. ID таблицы всех текущих ивентов
sheet_current_events_id = ""
sheet_past_events_id = ""
sheet_vol_id = ""

# -------------------------------------------------------------------------------------------------

# Область значений таблиц для поиска свойства "НАЗВАНИЕ или ИМЯ"
# Область значения таблицы "Участники Волонтёрства" для поска свойста "айди пользователя", "анонимность"
# "балы за ивенты", "статус Админа или Юзера"
# Начинаем со второй строки, т.к. первая под теги. Admin.sheet_current_events_id Admin.range_raw
range_name = 'A2:A'
range_user_id = 'E2:E'
range_sheet_id = 'G2:G'
range_anonymus = 'G2:G'
range_score = 'F2:F'
range_status = 'H2:H'
# Для поиска всех значения ряда
range_raw = 'A:I'

# Переменные таблицы "Текущие ивенты" для добавления элементов внутрь таблицы.
values = [[]]
body = {'values': values}
raw_value_input_option = "RAW"
user_value_input_option = "USER_ENTERED"

admin_buttons = ["🥳 Завершення Івенту", "💥Створення Івенту", "🧨Скасування Івенту",
                 "🦳 Список Волонтерів", "👾 Рейтинг для Адміна"]

user_buttons = ["🚀 Запис на Івент", "⚕ Свій Рейтинг", "☤ Рейтинг Студентів",
                "✍ Пропозиції", "✨ Особисті дані"]

boss_text = "Напишіть свої ідеї волонтерському сектору.\nМожливо, ви знаєте тих," \
            " кому потрібна допомога, чи хочете організувати якийсь захід?\nБудемо раді будь-яким пропозиціям 😉"

welcome_text = "Слава Україні! Героям слава!" \
               "\nВас вітає телеграм бот волонтерів ХНМУ\n" \
               "Почнемо процес реєстрації.\n" \
               "Напишіть своє ПІБ у чат до бота:"

hi_text = "Слава Україні! Героям слава!"

#Допустимые символы в нике
cancle_list = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']